arnoutzw/esp32-rover/firmware/sdkconfig.defaults.esp32cam
# ESP32-CAM Rover SDK Configuration
# Use this configuration for ESP32-CAM AI-Thinker module with camera

# Target ESP32
CONFIG_IDF_TARGET="esp32"

# Flash size (4MB for ESP32-CAM)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM support - required for ESP32-CAM camera buffer
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y

# Camera support
CONFIG_CAMERA_CORE0=y

# WiFi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# LWIP
CONFIG_LWIP_MAX_SOCKETS=16

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Disable WiFi NVS to prevent mode override issues
CONFIG_ESP_WIFI_NVS_ENABLED=n

# Task Watchdog - disable auto init (we init manually in app)
CONFIG_ESP_TASK_WDT_INIT=n
